#+title: P0001_checkup

#+PROPERTY: header-args:R  :tangle   yes
#+PROPERTY: header-args:R+ :eval     yes
#+PROPERTY: header-args:R+ :comments org
#+PROPERTY: header-args:R+ :results  output drawer pp
#+PROPERTY: header-args:R+ :exports  both
#+PROPERTY: header-args:R+ :var      BUFFER_DIR=(file-name-directory buffer-file-name)
#+PROPERTY: header-args:R+ :session  *R*

* Imports
#+begin_src R :session *R*
library(devtools)
library(tidyverse)
library(readr)
library(readr)

load_all(
  path="~/cc/dev/c2023a/c0512_apaTablesCoCoR/apaTablesCoCoR",
  reset=TRUE,
  recompile=TRUE,
  export_all=TRUE,
  helpers=TRUE,
  quiet=FALSE)

options("width" = 222)
options(cli.width=222)
paste(getwd())
#+end_src
* Load data
#+begin_src R :session *R* :results  output drawer pp
dir0 <- "../../data/v0003_supernatural/u1006_clean"
if0 <- "supernatural_intentional_agency"
if0 <- "supernatural_strategic_knowledge"
if0 <- "supernatural_acts_in_the_world"
df0 <- read_csv(file=paste(paste(dir0, if0, sep="/"), "csv", sep="."))
# df0 = read.csv(file=paste(dir0, if0, sep="/"))
paste(str(df0))
#+end_src

#+RESULTS:
#+begin_example
indexing supernatural_acts_in_the_world.csv [=============================================================================================================================================================] 2.84GB/s, eta:  0s                                                                                                                                                                                                                                                                 Rows: 216 Columns: 12
── Column specification ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
Delimiter: ","
chr  (1): text
dbl (11): HumEval, PietA, PietB, PietC, NicoPos, NicoNeg, NicoCom, BATot, BAPos, BANeg, BAAbs

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.
spc_tbl_ [216 × 12] (S3: spec_tbl_df/tbl_df/tbl/data.frame)
 $ HumEval: num [1:216] 2.14 3.31 3.57 1.5 3.08 ...
 $ PietA  : num [1:216] 0 0 0 0 0 0 0 0 0 0 ...
 $ PietB  : num [1:216] 0 0 0 0 0 0 0 0 0 0 ...
 $ PietC  : num [1:216] 0 0 0 0 0 0 0 0 0 0 ...
 $ NicoPos: num [1:216] 0 0 0 0 0 0 0 0 0 0 ...
 $ NicoNeg: num [1:216] 0 0 0 0 0 0 0 0 0 0 ...
 $ NicoCom: num [1:216] 0 0 0 0 0 0 0 0 0 0 ...
 $ BATot  : num [1:216] -0.0168 0.1307 0.101 0.0638 0.0302 ...
 $ BAPos  : num [1:216] 0 0.1307 0.101 0.0638 0.0302 ...
 $ BANeg  : num [1:216] 0.0168 0 0 0 0 ...
 $ BAAbs  : num [1:216] 0.0168 0.1307 0.101 0.0638 0.0302 ...
 $ text   : chr [1:216] "Cloud that disappears at night" "Cloud that disappears at night and has a beating heart" "Cloud that disappears at night and has a beating heart and feels empathy for dying plants" "Lamp that likes to listen to vacuum cleaners" ...
 - attr(*, "spec")=
  .. cols(
  ..   HumEval = col_double(),
  ..   PietA = col_double(),
  ..   PietB = col_double(),
  ..   PietC = col_double(),
  ..   NicoPos = col_double(),
  ..   NicoNeg = col_double(),
  ..   NicoCom = col_double(),
  ..   BATot = col_double(),
  ..   BAPos = col_double(),
  ..   BANeg = col_double(),
  ..   BAAbs = col_double(),
  ..   text = col_character()
  .. )
 - attr(*, "problems")=<externalptr>
character(0)
#+end_example

* Check correlations
- [[textcite:&DiedenhofenMusch2015a]]
- [[textcite:&Diedenhofen2022a]]
- https://f-santos.gitlab.io/2020-04-01-comparing-correlation-coefficients.html
#+begin_src R :session *R* :results  output drawer pp
df2 <- df0 %>% select(
    HumEval,
    PietA,
    PietB,
    PietC,
    NicoPos,
    NicoNeg,
    NicoCom,
    BATot,
    BAPos,
    BANeg,
    BAAbs,
)

devtools::unload(package="apaTables", quiet=FALSE)
load_all(path="~/cc/dev/c2023a/c0512_apaTablesCoCoR/apaTablesCoCoR",reset=TRUE,recompile=TRUE,export_all=TRUE,helpers=TRUE,quiet=FALSE)
tab0 <- apa.cocor.table(
  df2,
  filename=paste(paste("p0008_correlations", if0, sep="_"), "doc", sep="."),
  table.number=1,
  common="HumEval"
)
print(tab0)
#+end_src

#+RESULTS:
#+begin_example
ℹ Loading apaTables


Table 1

Means, standard deviations, and correlations with confidence intervals


  Variable   M    SD   1           2           3           4           5           6            7            8            9            10         11
  1. HumEval 3.20 0.98

  2. PietA   0.01 0.03 -.01                    -1.75       1.34        -2.02*      -0.47        -1.96        -2.03*       -3.05**      -0.21      -2.93**
                       [-.14, .13]

  3. PietB   0.01 0.03 .14*        .24**                   1.86        -0.34       1.17         -0.26        -0.61        -2.18*       1.25       -1.92
                       [.01, .27]  [.11, .37]

  4. PietC   0.01 0.03 -.02        .99**       .24**                   -2.13*      -0.57        -2.07*       -2.13*       -3.15**      -0.30      -3.03**
                       [-.15, .12] [.99, 1.00] [.11, .36]

  5. NicoPos 0.01 0.03 .17*        .16*        .09         .16*                    1.55         0.38         -0.15        -1.19        1.60       -1.13
                       [.04, .30]  [.03, .29]  [-.05, .22] [.03, .29]

  6. NicoNeg 0.00 0.01 .04         -.03        .21**       -.03        .22**                    -1.27        -1.36        -2.50*       0.33       -2.85**
                       [-.09, .17] [-.16, .10] [.07, .33]  [-.16, .10] [.09, .34]

  7. NicoCom 0.01 0.02 .17*        .17*        .04         .18**       .97**       -.04                      -0.22        -1.27        1.47       -1.17
                       [.03, .29]  [.04, .30]  [-.10, .17] [.04, .30]  [.95, .97]  [-.18, .09]

  8. BATot   0.04 0.10 .19**       .03         .40**       .03         -.00        -.24**       .06                       -2.78**      1.34       -1.16
                       [.05, .31]  [-.10, .16] [.28, .51]  [-.11, .16] [-.14, .13] [-.36, -.11] [-.07, .19]

  9. BAPos   0.06 0.07 .28**       -.01        .51**       -.01        -.03        -.06         -.02         .86**                     2.48*      0.09
                       [.16, .40]  [-.14, .12] [.40, .60]  [-.14, .12] [-.17, .10] [-.20, .07]  [-.15, .12]  [.82, .89]

  10. BANeg  0.02 0.05 .01         -.07        -.10        -.07        -.04        .36**        -.14*        -.76**       -.32**                  -3.76**
                       [-.12, .15] [-.20, .07] [-.23, .03] [-.20, .07] [-.17, .10] [.24, .47]   [-.26, -.00] [-.81, -.70] [-.44, -.20]

  11. BAAbs  0.08 0.07 .28**       -.06        .41**       -.06        -.06        .21**        -.12         .23**        .70**        .45**
                       [.15, .40]  [-.19, .07] [.29, .51]  [-.19, .07] [-.19, .07] [.08, .34]   [-.25, .01]  [.10, .36]   [.63, .76]   [.33, .55]


Note. M and SD are used to represent mean and standard deviation, respectively.
Values in square brackets indicate the 95% confidence interval.
The confidence interval is a plausible range of population correlations
that could have caused the sample correlation (Cumming, 2014).
 ,* indicates p < .05. ** indicates p < .01.
#+end_example
* Manual checkups
#+begin_src R :session *R* :results  output drawer pp
df2 <- as.data.frame(df2)
cc0 <- cocor::cocor(~HumEval+BATot|HumEval+BAPos, data=df2)
cc0 <- cocor::cocor(~HumEval+BAAbs|HumEval+PietB, data=df2)
cc0 <- cocor::cocor(~HumEval+PietB|HumEval+BAAbs, data=df2)
cc0 <- cocor::cocor(~HumEval+BATot|HumEval+PietA, data=df2, test=c("hittner2003"))

cc0
cc0@hittner2003$statistic
cc0@hittner2003$p.value
gtools::stars.pval(cc0@hittner2003$p.value)
#+end_src

#+RESULTS:
#+begin_example

  Results of a comparison of two overlapping correlations based on dependent groups

Comparison between r.jk (HumEval, BATot) = 0.0566 and r.jh (HumEval, PietA) = 0.0247
Difference: r.jk - r.jh = 0.0319
Related correlation: r.kh = 0.0294
Data: df2: j = HumEval, k = BATot, h = PietA
Group size: n = 216
Null hypothesis: r.jk is equal to r.jh
Alternative hypothesis: r.jk is not equal to r.jh (two-sided)
Alpha: 0.05

hittner2003: Hittner, May, and Silver's (2003) modification of Dunn and Clark's z (1969) using a backtransformed average Fisher's (1921) Z procedure
  z = 0.3343, p-value = 0.7382
  Null hypothesis retained
[1] 0.3342939
[1] 0.7381578
[1] " "
attr(,"legend")
[1] "0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1"
#+end_example
